/*-------------------------------
유투브 클론
----------------------------------*/

/*
    자바스크립트 풀스택이 되면 일렉트론을 할 수 있음
    일랙트론JS는 어플리케이션을 빌드하기 위한 것.
    예를 들면 iOS/안드로이드 뿐만 아니라
    데스크톱 어플(맥/윈도우/리눅스) 등 빌드할 수 있음.

    Visual Studio Code, 슬렉 앱, 워드프레스, 스카이프, 깃헙 등등 은 일렉트론 앱. (html, css, js로 빌드 됨)

    -----------------------------------------------

    웹앱의 예시 
    : 넷플릭스의 경우, 영화가 보여지고, 필터, 검색하고 클릭, 영화를 시청

    ****참고
    슈퍼 인터랙티브 => 웹앱 => 리액트 JS가 적절.
    웹앱을 만들 필요가 없다면 바닐라JS로 충분.

    웹사이트와 웹앱은 매우 다름
    우리가 만들건 웹사이트이긴 한데, 웹앱과 비슷한 웹사이트임.


    ----------------------------------------------------------

    Node JS 란?

    - JS를 브라우저 밖으로 가지고 나와서 유저가 사용할 수 있게 함
    (유저의 컴퓨터에서 돌아갈 수 있게 함)
    :: 즉, 브라우저 밖의 Javascript

    *서버를 만들 수 있고, 웹페이지에 접속해서 정보들을 수집할 수도 있음 (브라우저와 관계없이)

    ----------------------------------------------------------

    PHP와 함께 라라벨을 쓰지 않고, Python으로 Django를 쓰지 않고
    Node JS를 사용하는 이유
    1. JS를 좋아해서
    2. JS는 프론트 뿐만아니라 백엔드에도 사용할 수 있기 때문

    *Node JS는 python(Django) 와 php(라라벨)에 비해 갖춰진게 하나도 없음
    (본인이 모두 customize 할 수 있음)

    *****많은 데이터를 움직여야 할때 :: Node js를 사용하는 가장 좋은 케이스!!!
    - Database 생성, Database 삭제, 사용자에게 전송..이쪽에 저장 등등...
    - 데이터를 다루는 성능이 아주 좋음
    - 채팅기능을 만들때도 좋음

    **** 하드코어한 처리
    - 서버의 하드드라이버를 사용해야하고
    - 바이트 단위의 어려운 작업이나 디코딩 인코딩 등을 해야한다면 
    ======= Node JS를 추천하지 않음!!!

    정적인 웹사이트라면 PHP, Node JS, python 셋 다 괜찮다.

   ----------------------------------------------------------

    누가 Node JS를 사용하는가

    Paypal, Uber, Netflix 모두 Node JS 로 만들었따!

    - 데이터를 다루기 때문에 사용
    - 꼭 한가지 언어로만 백엔드를 만들 필요는 없음

    ----------------------------------------------------------

    Node JS 설치하기

    LTS 다운받기(window 유저용)
    (mac 유저용은 brew로 설치)

    **window의 경우 PATH 관련 문제가 생길 수 있음

    - 윈도우 명령어프롬프트(또는 Powershell) 로 가서
    - node라고 치면 실행됨.
    - node -v 라고 치면 node의 버젼을 표시해줌
    
*/